000001161130     A          R TITLE
000002161130     A                                  1 45'Weekly Payroll Report'
000003161130     A                                  1 86'Page:'
000004161130     A                                  1 92PAGNBR
000005161130     A                                  1  3DATE(*YY)
000006161130     A                                      EDTCDE(Y)
000007161130     A                                  1 15TIME
000008161130     A                                  2  3'Name: Ceyda Ansin'
000009161130     A          R COLHDG                    SPACEB(1)
000010161130     A                                     6'Employee'
000011161130     A                                      SPACEB(1)
000012161130     A                                    19'Work'
000013161130     A                                    29'Pay'
000014161130     A                                    37'Hourly'
000015161130     A                                    47'Hours'
000016161130     A                                    56'Regular'
000017161130     A                                    71'Overtime'
000018161130     A                                    89'Total'
000019161130     A                                     7'Number'
000020161130     A                                      SPACEB(1)
000021161130     A                                    19'Shift'
000022161130     A                                    29'Grade'
000023161130     A                                    38'Rate'
000024161130     A                                    47'Worked'
000025161130     A                                    58'Pay'
000026161130     A                                    74'Pay'
000027161130     A                                    90'Pay'
000028161130     A                                     7' '
000029161130     A                                      SPACEB(1)
000030161130     A          R EMPDETAIL                 SPACEB(1)
000031161130     A            EMPNUM    R    9S 0      5REFFLD(ALLSHIFT/EMPNUM SENECAPAY/A-
000032161130     A                                      LLSHIFT)
000033161130     A                                      EDTWRD('0   -   -   ')
000034161130     A            WORKSHIFT R    1A       20REFFLD(ALLSHIFT/WORKSHIFT +
000035161130     A                                      SENECAPAY/ALLSHIFT)
000036161130     A            PAYGRADE  R             30REFFLD(ALLSHIFT/PAYGRADE +
000037161130     A                                      SENECAPAY/ALLSHIFT)
000038161130     A            HOURLYRATE     5  2     37EDTCDE(1)
000039161130     A            HRSWORKED R             48REFFLD(ALLSHIFT/HRSWORKED +
000040161130     A                                      SENECAPAY/ALLSHIFT)
000041161130     A            REGULARPAY     7  2     55EDTCDE(1)
000042161130     A            OVERPAY        7  2     70EDTCDE(2)
000043161130     A            TOTALPAY       7  2     86EDTCDE(1)
000044161130     A          R TOTALS                    SPACEB(2)
000045161130     A                                    41'Totals:'
000046161130     A            TOTREGPAY      9  2     51
000047161130     A                                      EDTCDE(1 $)
000048161130     A            TOTOVTPAY      9  2     66EDTCDE(1 $)
000049161130     A            TOTEMPPAY      9  2     82EDTCDE(1 $)
