000100161031     A          R STUDENTSR                 PFILE(STUDENTS)
000101161031     A          K LASTNAME
000102161031     A          S FEESOWED                  COMP(GT 0)
