000100161130     A          R ALLSHIFT                  PFILE(SENECAPAY/ALLSHIFT)
000101161130     A          K EMPNUM
000102161204     A          S WORKSHIFT                 COMP(EQ 'N')
