000100161115     FMARKSDSP  CF   E             WORKSTN
000102160927                                                                     /FREE
000103160925              EXFMT RECORD1;
000104160925                   DOW NOT(*IN03);
000105160925                     EXSR GETGRADE;
000106160925                     WRITE RECORD1;
000107160925                     EXFMT RECORD2;
000108160925                     IF *IN03 = *OFF;
000109160925                       EXSR CLEARMARKS;
000110160925                       EXFMT RECORD1;
000111160925                     ENDIF;
000112160925                   ENDDO;
000113160925              *INLR = *ON;
000114160925              RETURN;
000115160925
000116160927       BEGSR GETGRADE;
000117160927
000118160926         TESTOVRALL = (TEST1 + TEST2 + TEST3)/3;
000120160927         NUMGRADE = (TESTOVRALL * 0.35) + (EXAM * 0.35) + (LABS);
000121160926         SELECT;
000122160926           WHEN NUMGRADE >= 90;
000123160926             LETGRADE = 'A+';
000124160926           WHEN NUMGRADE >= 80;
000125160926             LETGRADE = 'A';
000126160926           WHEN NUMGRADE >= 75;
000127160926             LETGRADE = 'B+';
000128160926           WHEN NUMGRADE >= 70;
000129160926             LETGRADE = 'B';
000130160926           WHEN NUMGRADE >= 65;
000131160926             LETGRADE = 'C+';
000132160926           WHEN NUMGRADE >= 60;
000133160926             LETGRADE = 'C';
000134160926           WHEN NUMGRADE >= 55;
000135160926             LETGRADE = 'D+';
000136160926           WHEN NUMGRADE >= 50;
000137160926             LETGRADE = 'D';
000138160926           WHEN NUMGRADE >= 0;
000139160928             LETGRADE = 'F';
000140160926           OTHER;
000141160927             LETGRADE = 'ERR';
000142160926         ENDSL;
000144160926       ENDSR;
000145160927
000146160927       BEGSR CLEARMARKS;
000147160927         TEST1 = 0;
000148160927         TEST2 = 0;
000149160927         TEST3 = 0;
000150160927         LABS = 0;
000151160927         EXAM = 0;
000152160927       ENDSR;
