000100161115     FSTUDENTDSPCF   E             WORKSTN
000101161115     FSTUDENTS  IF   E             DISK
000102161115
000103161115      /FREE
000104161115       READ STUDENTS;
000105161115       DOW (*IN03 = *OFF) AND (NOT %EOF);
000106161115           TOTALFEES=TOTALFEES+FEESOWED;
000107161115           TOTALFINES=TOTALFINES+FINESOWED;
000108161115           TOTALSTUD=TOTALSTUD+1;
000109161115
000110161115       *IN40 = *OFF;
000111161115       *IN41 = *OFF;
000112161115
000113161115       IF FEESOWED > 0;
000114161115         *IN40 = *ON;
000115161115       ENDIF;
000116161115
000117161115       IF FINESOWED > 0;
000118161115         *IN41 = *ON;
000119161115       ENDIF;
000120161115
000121161115       FULLNAME=%TrimR(FIRSTNAME)+' '+LASTNAME;
000122161115
000123161115         EXFMT RECORD1;
000124161115         READ STUDENTS;
000125161115       ENDDO;
000126161115
000127161115       TOTALOWING = TOTALFEES + TOTALFINES;
000128161115       EXFMT RECORD2;
000129161115       *INLR = *ON;
000130161115       RETURN;
000131161115       /END-FREE
