000100161004PGM
000101161004    CALL QGPL/STRJOB
000102161004    ADDLIBLE LIB(IBC233LIB)
000103161130    ADDLIBLE SENECAPAY
000104161004    MONMSG MSGID(CPF2103)
000105161004ENDPGM
