000100160912PGM
000200160912   DSPLIBL
000300160912   DSPSYSVAL QSYSLIBL
000400160912   DSPSYSVAL QUSRLIBL
000500160912   DSPSYSVAL QMODEL
000600160912ENDPGM
